import React, { useEffect, useState } from 'react'
import { Header } from '../../components/Header'
import { Footer } from '../../components/Footer'
import { useParams, useNavigate } from 'react-router-dom';
import { Carousel } from 'react-responsive-carousel';
import 'react-responsive-carousel/lib/styles/carousel.min.css';

export const MoreProfession = () => {


    const { id } = useParams();
    const [images, setImages] = useState([]);
    const [title, setTitle] = useState('');
    const [desc, setDesc] = useState();
    const [video, setVideo] = useState();
    const [buttonMore, setButtonMore] = useState();

    const imagesRestMaster = [
        { src: 'https://i.ibb.co/kgRmrgz/2.jpg' },
        { src: 'https://i.ibb.co/2W8RdkP/IMG-2447.jpg' },
        { src: 'https://i.ibb.co/74rv6rY/IMG-2451.jpg' }
    ]

    const imagesWaiterBarmenAdmin = [
        { src: 'https://i.ibb.co/QjsNvsF/IMG-2480.jpg' },
        { src: 'https://i.ibb.co/Jc3D6T7/IMG-2477.jpg' },
        { src: 'https://i.ibb.co/Nr7TZNV/IMG-2460.jpg' },
    ]

    const imagesConfectioner = [
        { src: 'https://i.ibb.co/SfQFbq0/image.jpg' },
        { src: 'https://i.ibb.co/LkmYfSk/4.jpg' },
        { src: 'https://i.ibb.co/t3RWfTW/3.jpg' }
    ]

    const imagesAdmin = [
        { src: 'https://i.ibb.co/vhPNpWv/image.jpg' },
        { src: 'https://i.ibb.co/3NjgBF8/1355927769-sam-9829.jpg' }
    ]

    const imagesFlorist = [
        { src: 'https://i.ibb.co/pdZTyHJ/image.jpg' },
        { src: 'https://i.ibb.co/pdZTyHJ/image.jpg' }
    ]

    const imagesHairMaster = [
        { src: 'https://i.ibb.co/1MqXDJL/IMG-1256.jpg' },
        { src: 'https://i.ibb.co/DQwZ41R/IMG-1233.jpg' },
        { src: 'https://i.ibb.co/4NPX5gk/2.jpg' }
    ]

    const imagesNailMaster = [
        { src: 'https://i.ibb.co/fX9LxT9/IMG-1216.jpg' },
        { src: 'https://i.ibb.co/3cVvcVy/IMG-1075.jpg' },
        { src: 'https://i.ibb.co/dpvZk7Q/IMG-1073.jpg' },
        { src: 'https://i.ibb.co/yWhQ6wJ/IMG-1072.jpg' },
        { src: 'https://i.ibb.co/9bSXL4r/IMG-1070.jpg' }
    ]

    const imagesFlowersMaker = [
        { src: 'https://i.ibb.co/yg2CLty/IMG-20220524-120029.jpg' },
        { src: 'https://i.ibb.co/LSv2965/IMG-20220524-115658.jpg' },
        { src: 'https://i.ibb.co/fSDbdNt/IMG-20220524-115552.jpg' },
    ]


    useEffect(() => {
        window.scrollTo(0, 0);
        if (id == 'rest-service-master') {
            setTitle('Майстер ресторанного обслуговування');
            setImages(imagesRestMaster);
            const desc_ = <div>
                <p className='news__card-desc'>Відвідування кафе чи ресторану дає людині можливість відпочити, поспілкуватися з друзями, скуштувати страви, які важко або неможливо приготувати у домашніх умовах. Місця, які подобаються, клієнти із задоволенням рекомендують іншим, збирають там цілі компанії і навіть відзначають урочисті події. Як правило, привабливість таких місць полягає не у чомусь одному (смачній їжі, стильному інтер’єрі, ввічливому обслуговуванні, живій музиці), а у сукупності цілого ряду складових, яку прийнято називати атмосферою. За тим, щоб заклад функціонував бездоганно, їжа була вишуканою і смачною, а в усіх відвідувачів був гарний настрій, повинен слідкувати майстер ресторанного обслуговування. Саме в його обов’язки входить завдання забезпечення належного сервісу.</p>
                <p className='news__card-desc'> <b>Майстер ресторанного обслуговування</b> – комплексна професія, яка синтезує у собі обов’язки офіціанта, бармена, кухаря, хостес, адміністратора, управлінця, обліковця, маркетолога. Це фахівець, що у разі потреби може самостійно управляти будь-якими процесами у ресторані, кафе, барі, ситуативно замінити відсутнього працівника.</p>
                <h3 className='news__card-desc'>В нашому Центрі Ви навчитеся:</h3>
                <ul>
                    <li>складати меню та прейскуранти</li>
                    <li>оформлювати рекламу</li>
                    <li>приймати відвідувачів, знайомити їх з меню, прейскурантом</li>
                    <li>риймати замовлення, обслуговувати відвідувачів в залі та за барною стійкою</li>
                    <li>обслуговувати банкети і прийоми тематичних заходів, іноземних туристів</li>
                    <li>вести облікову документацію, товарно-касову книгу, книгу обліку розрахункових операцій</li>
                    <li>здавати виручку в касу підприємства, виручку на розрахунковий рахунок в банк</li>
                    <li>складати графіки виходу на роботу</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного використовування випускників:</h3>
                <p className='news__card-desc'>Випускники знаходять використання при виконанні робіт, пов’язаних із обслуговуванням відвідувачів у закладах ресторанного господарства різних типів і класів. При цьому можуть не тільки технологічно правильно виконувати дані операції, але й уміють аналізувати, прогнозувати наслідки своєї діяльності та приймати правильні раціональні рішення в процесі виконання виробничого завдання. Випускнику по завершенню присвоюють кваліфікацію “кваліфікований робітник” за професією “Майстер ресторанного обслуговування” IV розряду.</p>
                <a className="news__card-more" href='https://drive.google.com/file/d/1rOPFygZLkPBpXlMT5lvb6DwBfLUJ5hw0/view' target='blank'>ДЕРЖСТАНДАРТ</a>
                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
        }
        else if (id == 'waiter-barmen-admin') {
            setTitle('Офіціант. Бармен');
            setImages(imagesWaiterBarmenAdmin);
            const desc_ = <div>
                <h2 className='news__card-desc'>ОФІЦІАНТ</h2>
                <p className='news__card-desc'>Сьогодні професія офіціанта є однією з найбільш популярних професій у нашій країні. Робота офіціанта полягає не тільки в обслуговуванні відвідувачів (прийому замовлень, подача на стіл блюд і грошовий розрахунок). Офіціант – публічна професія, він представляє кафе, бар або ресторан. Чим вище рівень ресторану, тим більші обов\’язки і відповідальність у офіціанта. Однак, щоб опинитися в елітному закладі, який обслуговує прийоми на найвищих рівнях, необхідно пройти жорсткий відбір, продемонструвавши себе в повній бойовій готовності. Офіціант повинен досконало володіти всіма тонкощами етикету, за лічені хвилини вміти сервірувати стіл. А знати специфіку приготування та подачі фірмових, національних та звичайних страв просто необхідно. Офіціанту також потрібно прекрасно орієнтуватися в меню та карті вин. А гострий розум, почуття гумору та широкий кругозір будуть тільки додатковим бонусом при відборі офіціантів.</p>
                <p className='news__card-desc'>При навчанні використовуються авторські інтерактивні методики з використанням навчальних відеоматеріалів.</p>
                <h3 className='news__card-desc'>Вас навчать:</h3>
                <ul>
                    <li>готувати зал до обслуговування споживачів</li>
                    <li>отримувати посуд, прибори, столову білизну</li>
                    <li>полірувати посуд, прибори</li>
                    <li>складати серветки різними способами</li>
                    <li>здійснювати попередню сервіровку столів</li>
                    <li>приймати замовлення від споживачів</li>
                    <li>отримувати страви в роздавальні та в буфеті</li>
                    <li>подавати страви і напої;</li>
                    <li>обслуговувати неофіційні банкети</li>
                    <li>оформляти рахунки і розраховуватися по них зі споживачами</li>
                    <li>прибирати використаний посуд та прибори</li>
                    <li>замінювати столову білизну</li>
                </ul>
                <h2 className='news__card-desc'>БАРМЕН</h2>
                <p className='news__card-desc'>Дуже популярною серед молоді є й професія бармена. Це й не дивно, адже матеріальна забезпеченість – одна з переваг цієї роботи. Ми звикли до того, що бармен – це людина, яка красиво наливає в келих пиво або інші алкогольні напої. Він продає спиртне, стоячи за барною стійкою, і обслуговує відвідувачів. Сьогодні професія бармена одержала новий виток в розвитку. Тепер бармен – це не людина з міркою для рідини в руці. Культура розпивання спиртних і безалкогольних напоїв змінюється разом з рівнем і достатком населення. В столицях різних країн бармен «окультурює», робить саму процедуру розпивання приємнішою. Сьогодні робота барменом – це мистецтво. Мистецтво, якому навчають. Молодих людей – бармен в основному професія для чоловіків – запрошують на різноманітні тренінги, семінари і лекції, які підкріплюються практикою. Тож для досягнення вершин цієї справи, почніть з найменшого – з навчання. В нашому Центрі висококваліфіковані педагоги нададуть вам всі необхідні професійні знання за спеціальністю «Офіціант. Бармен. Адміністратор».</p>
                <h3 className='news__card-desc'>По закінченню навчання бармен уміє:</h3>
                <ul>
                    <li>обслуговувати споживачів: пропонувати, показувати, реалізовувати готові до споживання алкогольні, безалкогольні, слабоалкогольні напої (міцні, десертні, ігристі, гроги, глінтвейни, дейзі тощо)</li>
                    <li>змішувати компоненти напоїв в шейкері, крюшонницях, блендері, збивати їх за допомогою інструментів</li>
                    <li>готувати холодні та гарячі закуски: з грибів, сандвічів, канапе, сосисок, ковбаси, шинки, фаршированих яєць, овочів, фруктів, ягід тощо</li>
                    <li>зустрічати споживачів, ознайомлювати їх з асортиментом і рецептурою напоїв, які реалізуються в барах</li>
                    <li>організовувати роботу і керувати барменами, які мають нижчу кваліфікацію</li>
                    <li>забезпечувати додержання порядку розрахунків із споживачами, ведення необхідного обліку, складання та здавання товарних звітів, виручки, чеків</li>
                </ul>
                <h3 className='news__card-desc'>Сфера застосування професійних якостей випускників:</h3>
                <p className='news__card-desc'>Випускники нашого Центру після закінчення навчання зможуть працевлаштовуватися в сферу торгівлі, заклади ресторанного господарства.</p>
                <div style={{display:'flex', flexWrap:'wrap', gap:'20px'}}>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1ofVBsgT-9qrLicZR8IhYP1EXPHeqbwv-/view' target='blank'>ДЕРЖСТАНДАРТ "ОФІЦІАНТ"</a>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1Go1mSFD8VZxwbdyVKYzDRIKMrs8WP0Ol/view' target='blank'>ДЕРЖСТАНДАРТ "БАРМЕН"</a>
                </div>

                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
        }
        else if (id == 'confectioner') {
            setTitle('Кухар. Кондитер');
            setImages(imagesConfectioner);
            const desc_ = <div>
                <h2 className='news__card-desc'>КУХАР</h2>
                <p className='news__card-desc'>Мистецтво куховарити – одне з найдавніших. Справжній кухар – це талант, яким володіє не кожна людина. По суті, кухар повинен мати особливий кулінарний смак, рухливість рук, адже протягом дня постійно щось чистить, ріже, при цьому пробує страву в момент приготування. Завдяки фантазії та вмінню професійних кухарів, кондитерів ми маємо змогу насолоджуватися незрівнянними стравами, які задовольняють не тільки наш апетит, але й естетичні вподобання. Оволодіти всіма таємницями надзвичайно популярної в наші дні професії Вам допоможе наш Центр.</p>
                <h3 className='news__card-desc'>У нас Ви навчитеся:</h3>
                <ul>
                    <li>здійснювати процеси первинної кулінарної обробки сировини</li>
                    <li>здійснювати допоміжні роботи з виготовляння страв та кулінарних виробів</li>
                    <li>формувати та панірувати напівфабрикати</li>
                    <li>готувати страви та кулінарні вироби, потребують нескладної кулінарної обробки: варити, смажити, запікати та випікати вироби</li>
                    <li>виготовляти страви з концентратів</li>
                    <li>порціонувати (комплектувати), роздавати страви масового попиту</li>
                </ul>
                <h2 className='news__card-desc'>КОНДИТЕР</h2>
                <p className='news__card-desc'>Східні рахат-лукум и халва, австрійський яблучний штрудель, французька тарталетка й відома шарлотка, англійські трюфелі… Так, це професія кондитера. Майстри з приготування солодощів цінувалися в будь-які часи. А рецепти знаменитих блюд зберігалися в суворій таємниці, передавалися в спадок від батька до сина.</p>
                <p className='news__card-desc'>Попит на професію «кондитер» і на сьогодні дуже великий. Цей рід діяльності має своєю умовою майстерне виготовлення різноманітних борошняних та цукрових кондитерських виробів. Вафлі, печиво, торти, кекси, шоколад, желе, морозиво, варення – це далеко не повний список усіма улюблених солодощів, якими може порадувати кондитер. Людина цієї професії готує за рецептами різні види тіста, начинки, крема. Окрім того, до його обов’язків входить і приготування напівфабрикатів, з яких потім печуться різноманітні вироби.</p>
                <p className='news__card-desc'>Однією з особливістю професії кондитера є те, що багато специфічної роботи йому доводиться робити вручну. Наприклад, прикрашати та розписувати торти кремом. Професія «кондитер» – складна і потребує не лише естетичного смаку та художніх здібностей від робітника, але багатьох знань та вмінь. У нашому навчальному закладі Ви зможете оволодіти цими знаннями та навичками.</p>
                <h3 className='news__card-desc'>Після навчання Ви вмітимете:</h3>
                <ul>
                    <li>готувати прості масові торти, тістечка та поштучні кондитерські та хлібобулочні вироби з нанесенням трафаретного малюнка за еталоном фарбою або з нескладним поєднанням фарб різних видів сировини (борошняної, сирної маси або морозива)</li>
                    <li>виготовляти види тіста, кремів, начинок, фаршів</li>
                    <li>готувати, штампувати напівфабрикати, формувати та викладати вироби на листи</li>
                    <li>оздоблювати вироби помадкою, марципаном, шоколадом, кремом тощо</li>
                    <li>передавати на гартування вироби з морозива</li>
                    <li>випікати (смажити) вироби</li>
                </ul>
                <h3 className='news__card-desc'>Сфера використання професійних навичок випускника:</h3>
                <p className='news__card-desc'>По закінченню навчання наші випускники зможуть працювати на підприємствах громадського харчування (в ресторанах, кафе, їдальнях), в кондитерській промисловості (хлібокомбінатах, пекарнях тощо).</p>
                <div style={{display:'flex', flexWrap:'wrap', gap:'20px'}}>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1K9bZQHpvGSIGASgBdqs03lw2nn1Ifm8a/view' target='blank'>ДЕРЖСТАНДАРТ "КУХАР"</a>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1NertFXcxWLvxMC8HUadImlQAzoCjwTPI/view' target='blank'>ДЕРЖСТАНДАРТ "КОНДИТЕР"</a>
                </div>

                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
            setVideo(
                <div>
                    <div style={{marginTop:'-5%'}} className='wrapper'>
                        <h3 className="places__title section-title">Професія "Кухар"</h3>
                    </div>
                    <div className="staff__wrapper">
                        <div className="staff__item">
                            <iframe className='staff__element' src="https://www.youtube.com/embed/RMXVDqxxaGA?si=WEBSbeFL_LHZxPuN" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
                        </div>
                    </div>
                </div>
            );
        }
        else if (id == 'admin') {
            setTitle('Адміністратор. Агент з організації туризму')
            setImages(imagesAdmin);
            const desc_ = <div>
                <h2 className='news__card-desc'>АДМІНІСТРАТОР</h2>
                <p className='news__card-desc'>Професія адміністратора передбачає здійснення роботи з ефективного та культурного обслуговування відвідувачів. Адміністратор – багатогранна спеціальність, з доволі широким переліком професійних якостей. Професія користується стабільним попитом на ринку праці – адміністратор потрібен майже у всіх галузях – від салону краси до великого виробничого підприємства.</p>
                <h3 className='news__card-desc'>У нас Ви навчитеся:</h3>
                <ul>
                    <li>забезпечувати роботу з ефективного культурного обслуговування відвідувачів</li>
                    <li>створювати для них комфортні умови</li>
                    <li>здійснювати контроль за збереженням матеріальних цінностей</li>
                    <li>консультувати відвідувачів з питань наявних послуг</li>
                    <li>вживати заходів щодо запобігання конфліктних ситуацій</li>
                    <li>розглядати претензії, пов’язані з незадовільним обслуговуванням відвідувачів, вживати відповідних організаційно-технічних заходів</li>
                    <li>здійснювати контроль за раціональним оформленням приміщень, стежити за оновленням станом реклами у приміщеннях на будівлі</li>
                    <li>забезпечувати чистоту порядок в приміщеннях на прилеглих до них територіях</li>
                    <li>контролювати додержання робітниками підприємства, установи, організації трудової виробничої дисципліни, правил норм охорони праці, вимог виробничої протипожежного захисту</li>
                    <li>інформувати керівництво підприємства, про наявні недоліки в організації обслуговування відвідувачів, вживати заходів щодо здійснювати контроль за виконанням працівниками вказівок керівництва підприємства</li>
                </ul>
                <h2 className='news__card-desc'>АГЕНТ З ОРГАНІЗАЦІЇ ТУРИЗМУ</h2>
                <p className='news__card-desc'>Подобається подорожувати, цікавишся культурою інших народів і при цьому бажаєш отримати престижну професію? Тоді спеціальність агента з організації туризму саме для тебе!</p>
                <p className='news__card-desc'>Багато людей люблять мандрувати, проводити свою відпустку у туристичних подорожах. Щоб відпочинок або подорож були цікавими та зручними, варто скористатися послугами туристичних фірм, агенцій, де можна отримати вичерпні відповіді на запитання щодо конкретної подорожі чи туристичної поїздки. Тут можна дізнатися про вартість подорожі, умови, що пропонує туристична фірма (транспорт, побут, харчування, екскурсійне обслуговування) тощо. Дати відповідь на ті питання та допомогти людям найбільш повно задовольнити свої бажання може агент з організації туризму.</p>
                <h3 className='news__card-desc'>В нашому навчальному закладі ви навчитесь:</h3>
                <ul>
                    <li>виконувати роботи, пов’язані з реалізацією комплексу туристичних послуг</li>
                    <li>бути представником суб’єкта туристичної діяльності виступати його</li>
                    <li>діяти відповідно до законодавства України про туризм та інших нормативних актів органів виконавчої влади в галузі</li>
                    <li>працювати керівництвом професіонала з туристичної діяльності</li>
                    <li>вивчати вітчизняний та зарубіжний ринки туристичних послуг, характеристики обертів туристичної</li>
                    <li>робити аналіз змісту, вартості, особливостей послуг готелів, музеїв, транспортних підприємств</li>
                    <li>брати участь у розробці внутрішніх та міжнародних маршрутів</li>
                    <li>самостійно здійснювати підготовку даних для складання кошторисів турів або екскурсій</li>
                    <li>виконувати рекламну діяльність з метою залучення громадян до оздоровлення, раціонального використання вільного часу, проведення змістовного дозвілля, ознайомлення з історико-культурною спадщиною, природним середовищем</li>
                    <li>надавати повну інформацію про обсяг, умови та якість туристичних послуг, що пропонуються суб’єктом туристичної діяльності</li>
                    <li>самостійно вести облік заявок договорів на проведення турів або екскурсій складати документи звітності</li>
                    <li>брати участь в оформленні угод споживачами туристичних послуг, туристичних ваучерів, путівок, маршрутних книжок, інших документів, що визначають статус туристів основою для здійснення туру або екскурсії</li>
                    <li>забезпечувати своєчасне придбання проїзних документів для груп туристів, виконувати обов’язки, покладені на нього суб’єктом туристичної діяльності</li>
                    <li>виконувати роботу з посольствами та консульськими відділами для отримання віз</li>
                    <li>використовувати комп’ютерну та офісну техніку</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного використання:</h3>
                <p className='news__card-desc'>Aгент з організації туризму буде запитуваний у туристичних агенціях, без адміністратора не обійтися у готельно-ресторанній сфері, туристичних комплексах, салонах краси, великих магазинах, приватних освітніх центрах, клініках, у розважальних центрах, спортивних закладах тощо.</p>
                <div style={{display:'flex', flexWrap:'wrap', gap:'20px'}}>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1LXWceV8cg7-wTeVLmk2x-3mbHiM5oNYj/view' target='blank'>ДЕРЖСТАНДАРТ "АДМІНІСТРАТОР"</a>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/15Y1FGoLDhqUEnvejCYqbUezvsXWUxcfG/view' target='blank'>ДЕРЖСТАНДАРТ "АГЕНТ З ОРГАНІЗАЦІЇ ТУРИЗМУ"</a>
                </div>

                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
            setVideo(
                <div>
                    <div style={{marginTop:'-5%'}} className='wrapper'>
                        <h3 className="places__title section-title">Професія "Адміністратор. Агент з організації туризму"</h3>
                    </div>
                    <div className="staff__wrapper">
                        <div className="staff__item">
                            <iframe className='staff__element' src="https://www.youtube.com/embed/VlEj2CakXVg?si=5uCBmSJ4RZl9FA7D" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
                        </div>
                    </div>
                </div>
            )
        }
        else if (id == 'florist') {
            // 
            setTitle('Флорист');
            setImages(imagesFlorist);
            const desc_ = <div>
                <p className='news__card-desc'>З давніх давен до нашого часу квіти відігравали важливу роль в житті всіх народів. Бенкети й війни, похоронні церемонії, церковні свята, весілля та народження не обходилися без квіткового вбрання. Квіти виступали як символ вірності, печалі, щастя, розпусти, зв\’язку із загробним світом, самозакоханості, а також багато чого іншого. За допомогою кольорів люди і сьогодні висловлюють сильні почуття.</p>
                <p className='news__card-desc'>Як перетворити оберемок квітів на вишуканий букет? Як продовжити рослинам життя? Чи можна пофарбувати білі троянди? Які квіти приваблюють бджіл, а які – дівчат? На усі ці запитання знає відповіді флорист. Якщо ви бажаєте поринути з загадковий світ та відчуваєте нестримне бажання втілювати свої фантазії, створюючи оригінальні композиції на основі квітів, ми з радістю чекаємо на вас!</p>
                <h3 className='news__card-desc'>Після закінчення навчання ви будете вміти:</h3>
                <ul>
                    <li>готувати для роботи рослинний матеріал: квіти, гілки, плоди, листя тощо</li>
                    <li>створювати флористичні композиції</li>
                    <li>оформлювати свята, весільні церемонії, банкети, дні народження та ін.</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного застосування:</h3>
                <p className='news__card-desc'>Bипускники можуть працевлаштовуватися у квіткові магазини, салони, студії, галереї.</p>
                <h3 className='news__card-desc'>КОРОТКОСТРОКОВІ КУРСИ:</h3>
                <p className='news__card-desc'>
                    <a href='https://drive.google.com/file/d/12Vf1D7SQy6Ik-DqFXZmfqpbM8rv1AhYP/view' target='blcnk'>Курс “Букети. Основи складання”</a>
                </p>
                <p className='news__card-desc'>
                    <a className='news__card-desc' href='https://drive.google.com/file/d/1DdX1_KWTIzWmSIrqja8fO_RxzOkm-TVV/view' target='blcnk'>Курс “Букети-іграшки. Основи складання”</a>
                </p>
                <p className='news__card-desc'>
                    <a className='news__card-desc' href='https://drive.google.com/file/d/1u5DGJALUJmoyHsOlox2_1GwpgU_xSeh9/view' target='blcnk'>Курс “Букети і композиції з використанням овочів, фруктів, солодощів”</a>
                </p>
                <a className="news__card-more" href='https://drive.google.com/file/d/1alx3zVsF3RHf6DdDOp9u6C-vg9oedXmn/view' target='blank'>ДЕРЖСТАНДАРТ</a>
                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
        }
        else if (id == 'hair-master') {
            setTitle('Перукар (перукар-модельєр)');
            setImages(imagesHairMaster);
            const desc_ = <div>
                <p className='news__card-desc'><b>Перукар (перукар-модельєр)</b> – це одна з найдавніших і поважних професій. В народі кажуть, що зробити людину красивою можуть два майстри – один з них кравець, а другий – перукар. І це правильно, адже вдало підібрана зачіска, вмілий макіяж можуть не тільки змінити зовнішній вигляд людини, але й поліпшити її внутрішній стан, зробити її на певний час щасливою. Кожне обличчя – загадка, і перукар повинен щоразу її розгадувати, знаходити єдність, гармонію між зачіскою та овалом обличчя, розрізом очей і загальним стилем людини. Роботи перукаря можна порівняти з творчістю художника. Ця професія належить до професії художнього типу.</p>
                <p className='news__card-desc'>Люди в усі часи прагнули бути красивими, і тому професія перукаря завжди була досить престижною, такою вона залишається й нині. Майстром перукарської справи може стати не кожний, тому вона вимагає від людини певних індивідуально-психологічних властивостей. Найбільше цей фах пасує людям комунікабельним, для яких спілкування з людьми не є обтяжливим, а приносить задоволення. Він має бути доброзичливим, витриманим, врівноваженим, уважним та акуратним. Справжнього майстра відрізняє бездоганний художній смак, образне мислення, творчій підхід до своєї справи, вміння переконати клієнта. Для майстра важливо і необхідно завжди мати хороший настрій, дарувати його своїм клієнтам.</p>
                <p className='news__card-desc'>Перукар – це фахівець в області створення стилю людини за допомогою зачіски. Однак він не лише стриже, фарбує, сушить і завиває волосся, але й майстерно використовує машинку й фен, знає особливості хімічних розчинів фарб і їх біологічний вплив на людину. Перукар може бути фахівцем з жіночих, чоловічих або дитячих зачісок, або перукарем-універсалом.</p>
                <h3 className='news__card-desc'>По закінченні навчання ви вмітимете:</h3>
                <ul>
                    <li>виконувати різні види стрижок, зачісок</li>
                    <li>виконувати фарбування, хімічну завивку і укладку волосся</li>
                    <li>доглядати і лікувати волосся</li>
                    <li>коригувати форму вус і бороди</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного використання:</h3>
                <p className='news__card-desc'>Hаші випускники можуть працевлаштовуватися у салони краси, перукарні, косметичні центри тощо.</p>
                <a className="news__card-more" href='https://drive.google.com/file/d/14zvFEmEH6Au6Nf4QwE8xHTQcnt2ZSmPj/view' target='blank'>ДЕРЖСТАНДАРТ</a>
                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
            setVideo(
                <div>
                    <div style={{marginTop:'-5%'}} className='wrapper'>
                        <h3 className="places__title section-title">Професія "Перукар (перукар-модельєр)"</h3>
                    </div>
                    <div className="staff__wrapper">
                        <div className="staff__item">
                            <iframe className='staff__element' src="https://www.youtube.com/embed/UlU5dgB-vf4?si=whBQqUiRpco5IPju" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
                        </div>
                    </div>
                </div>
            );
        }
        else if (id == 'nail-master') {
            setTitle('Манікюрник. Педикюрник');
            setImages(imagesNailMaster);
            const desc_ = <div>
                <p className='news__card-desc'>Є такі професії, без яких не змогла б обійтися жодна людина. Перукар, манікюрник, педикюрник – саме така. Це дуже цікава і прибуткова професія. За останні роки ця галузь краси бурхливо розвивається, і одночасно зростає потреба в компетентних фахівцях. Однак, тільки за умови того, що майстер досконало володіє всіма таємницями цього мистецтва, можна бути впевненим, що клієнт вибере саме Вас. Красиві доглянуті нігті – візитна картка сучасної людини. Доглянуті руки та ідеальні нігті додають впевненості у собі, підіймають настрій та неодмінно привертають увагу оточуючих, доставляючи усім естетичне задоволення. Тому ця професія зараз необхідна, престижна і чудово оплачувана.</p>
                <p className='news__card-desc'>Останнім часом робота манікюрниці стала більш різноманітною із застосуванням нових операцій. Серед послуг, окрім звичного манікюру, і європейський манікюр, при якому нігті обробляються за допомогою спеціальних приладів. З’явилися можливості для творчості. Сучасний майстер підбирає необхідний для створення задуманого образу колір, відтінок, вручну створює малюнок на нігті (рослинний орнамент, візерунки різних стилів). Застосовують також техніки аплікації й інкрустації.</p>
                <p className='news__card-desc'>Педикюр, постійний догляд за ногами – краща гарантія краси здоров’я. Доглянуті ніжки – це розкіш, а не засіб пересування, дозвольте собі бути красивими! У поєднанні із загальним гігієнічним доглядом за тілом манікюр і педикюр поліпшує стан організму, попереджує розвиток захворювань кісток рук, стоп і пальців ніг.</p>
                <h3 className='news__card-desc'>У нас ви навчитеся:</h3>
                <ul>
                    <li>обробляти, обпилювати ніготь для надання необхідної форми довжини</li>
                    <li>покривати лаком за всіма правилами виконання манікюрних робіт</li>
                    <li>нарощувати нігті на руках і ногах сучасними методами, акрилами, гелями</li>
                    <li>виконувати дизайн: ліпку акрилами, художній розпис лаками і акриловими фарбами</li>
                    <li>обробляти шкіру рук, ніг, проводити їх масаж</li>
                    <li>правильно виконувати дезінфекцію інструментів</li>
                    <li>застосовувати правила обслуговування, способи надання першої медичної допомоги</li>
                    <li>правильно використовувати існуючі інструменти, правильно їх зберігати</li>
                    <li>пізнати секрети виготовлення розчинів кремів, приготування комбінованих лаків різних кольорів , використання розчинників</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного застосування випускника:</h3>
                <p className='news__card-desc'>Майстри працюють у перукарнях, салонах краси, косметичних кабінетах, на показах у великих магазинах, театрах тощо.</p>
                <div style={{display:'flex', flexWrap:'wrap', gap:'20px'}}>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1AM_rYyL5szLcwrFiZQD3UXoTQjeEqoOK/view' target='blank'>ДЕРЖСТАНДАРТ "МАНІКЮРНИК"</a>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/11eqWCc8R-5PRP3UADTh49d8T_0B9mP_R/view' target='blank'>ДЕРЖСТАНДАРТ "ПЕДИКЮРНИК"</a>
                </div>

                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
        }
        else if (id == 'flowers-maker') {
            setTitle('Квітникар. Декоратор вітрин');
            setImages(imagesFlowersMaker);
            const desc_ = <div>
                <p className='news__card-desc'><b>Квітникар</b> – це працівник, який вирощує квіти, кущі, дерева та доглядає за рослинами. Він має безпосереднє відношення до краси, оскільки завдяки його старанній та наполеглевій праці ми маємо можливість вибрати в магазині квіти чи замовити букет найближчим чи поважним людям в знак пошани, подарунка, подяки. Щоб виростити квіти різноманітних декоративних якостей і в будь-яку пору року, необхідно знати справу квітникаря.</p>
                <p className='news__card-desc'>Професія квітникаря передбачає навчання учнів оброблюванню та вирощуванню квітів і декоративно-листяних рослин. Вона дозволяє створити красивий ландшафтний дизайн вулиці, парку, бульвару, присадибної території, палісадника й балкону. А для створення цієї краси необхідно отримати знання про рослини, їх біологічні особливості, умови вирощування, про правила оформлення територій нових сучасних об’єктів, про нові напрямки моди в ландшафтному дизайні та декоративно-прикладному мистецтві. У зв’язку із пожвавленням у галузі будівництва й високими вимогами до екології навколишнього середовища велика увага приділяється озелененню. Тому попит на спеціалістів у сфері квітникарства зростає. Тож не зволікайте з отриманням перспективної професії!</p>
                <p className='news__card-desc'><b>Декоратор вітрин</b> – це не просто робота, що вимагає навиків або вигостреної техніки. Тут потрібний художній смак, відчуття краси і розуміння прекрасного. Декоратор вітрин повністю продумує оформлення приміщення магазину, салону чи ресторану: від розташування обладнання до кольорового рішення зали. Декоратор враховує вплив певних кольорів та їх поєднання на людину.</p>
                <p className='news__card-desc'>Він керується правилом, що зручне розташування обладнання та вдале кольорове рішення підвищують продуктивність праці сспівробітників, створюють гарний настрій у покупців. Історія цього виду діяльності бере свій початок в середині XIX століття і пов’язана з розвитком індустріального виробництва, що створив потреби в новій професії.</p>
                <h3 className='news__card-desc'>Після закінчення нашого навчального закладу ви навчитеся:</h3>
                <ul>
                    <li>виконувати допоміжні роботи, пов’язані з прибиранням клумб, рабаток бордюрів</li>
                    <li>забезпечувати робочі місця посадочним матеріалом, добривами інвентарем</li>
                    <li>очищати рослини в оранжереях, проводити обмивання обприскування водою</li>
                    <li> готувати квіткові рослини до викопування</li>
                    <li>складати плани художнього оформлення інтер’єру та вітрин на підставі комплексної програми реклами товарів та послуг, контролювати їх виконання</li>
                    <li>вибирати виразні засоби та розробляти технічні рішення для кожного типу вітрини, стилю викладення характеру рекламування товару (послуги)</li>
                    <li>здійснювати роботи з художнього та художньо-декоративного оформлення внутрішнього простору магазину (закладу харчування), малювати рекламні плакати, вивіски, щити, оформлювати стенди, настінні панно, внутрішньо- та зовнішньомагазинні вітрини</li>
                    <li>проектувати композиційні рішення вітрини та рекламного показу товарів (надання послуг) у внутрішньому просторі підприємства</li>
                    <li>розробляти та розміщувати у внутрішньому просторі магазину символи-покажчики товарних та функціональних відділів підприємства або окремих товарних комплексів обідніх залів та фойє закладів харчування</li>
                    <li>готувати для оформлення вітрини вітринну коробку та вітринний інвентар</li>
                    <li>викладати товари та монтувати декоративні елементи вітрини</li>
                    <li>надписувати та художньо оформлівати цінники на товари, що розміщені на експозиційних стендах та у вітринах</li>
                </ul>
                <h3 className='news__card-desc'>Сфера професійного використання випускника:</h3>
                <p className='news__card-desc'>Квітникарі можуть працевлаштуватися в будь-яких квіткових господарствах відкритого та закритого ґрунту; декоратори вітрин затребувані для художнього оформлення та декорування рекламно-інформаційного пристроїв інтер’єру, вітрин та торгівельно-вітринного обладнання торгівельного комплексу, виїзних ярмарок, виставок-продажу на таких видах підприємств: торговельні комплекси; заклади харчування; театри; готелі та ін.</p>
                <h3 className='news__card-desc'>КОРОТКОСТРОКОВІ КУРСИ:</h3>
                <p className='news__card-desc'>
                    <a href='https://drive.google.com/file/d/1P8jJb-Y7kKXyNXLX11-ydQjI2mN1c0A1/view' target='blcnk'>Курс “Цибулинні рослини”</a>
                </p>
                <p className='news__card-desc'>
                    <a className='news__card-desc' href='https://drive.google.com/file/d/1GfiDPur7ttZ8DVKdQhYnHO9dBkbay37W/view' target='blcnk'>Курс “Троянди. Висаджування, догляд, обрізування, боротьба з хворобами та шкідниками”</a>
                </p>
                <p className='news__card-desc'>
                    <a className='news__card-desc' href='https://drive.google.com/file/d/1_GQbcTKTn8XER2Dy51Pqc4K_rr80XVoW/view' target='blcnk'>Курс “Дворічники та однорічники. Особливості висаджування та догляду”</a>
                </p>
                <div style={{display:'flex', flexWrap:'wrap', gap:'20px'}}>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/1eZ4xHlAgR6GGqP9rtOM1k193ggm5f1I8/view' target='blank'>ДЕРЖСТАНДАРТ "КВІТНИКАР"</a>
                    <a style={{width:'auto'}} className="news__card-more" href='https://drive.google.com/file/d/11OSasq2s52-3a2pH83IzuDQJrs5-qc6k/view' target='blank'>ДЕРЖСТАНДАРТ "ДЕКОРАТОР ВІТРИН"</a>
                </div>

                <br></br>
                <br></br>
                <br></br>
            </div>
            setDesc(desc_);
        }
    }, [id]);

    return (
        <div>
            <Header />
            <section className="benefits">
                <div className="benefits__wrap">
                    <h2 className="benefits__title">{title}</h2>
                    <Carousel autoPlay infiniteLoop showArrows={false} showStatus={false}>
                        {images.map((image, index) => (
                            <div className="carousel-container" key={index}>
                                <img src={image.src} alt={`Slide ${index + 1}`} />
                            </div>
                        ))}
                    </Carousel>
                    <div className='wrapper'>
                        {desc}
                    </div>
                </div>
            </section>
            {video}
            <Footer />
        </div>
    )
}
